tests/basic.yml
config:
  target: "https://animo-mediator-qa.ngotag.com"
  phases:
    # Warm-up phase: 1 wallet per second for 10 seconds
    - duration: 10
      arrivalRate: 1
      name: "Warm-up"
    
    # Ramp-up phase: gradually increase from 2 to 10 wallets per second over 30 seconds
    - duration: 30
      arrivalRate: 2
      rampTo: 10
      name: "Ramp-up"
    
    # Peak load phase: 10 wallets per second for 20 seconds  
    - duration: 20
      arrivalRate: 10
      name: "Peak Load"
    
    # Cool-down phase: reduce from 10 to 2 wallets per second over 15 seconds
    - duration: 15
      arrivalRate: 10
      rampTo: 2
      name: "Cool-down"
      
  processor: "./processor.js"
  environments:
    NODE_NO_WARNINGS: 1

scenarios:
  - name: "Mediation Load Test"
    flow:
      - function: "connectToMediator"