tests/burst.yml
config:
  target: "https://animo-mediator-qa.ngotag.com"
  phases:
    # Sudden burst: 50 wallets per second for 10 seconds
    - duration: 10
      arrivalRate: 50
      name: "Burst Test"
      
    # Recovery period: let connections complete
    - duration: 30
      arrivalRate: 0
      name: "Recovery"
      
  processor: "./processor.js"
  environments:
    NODE_NO_WARNINGS: 1

scenarios:
  - name: "High Volume Burst Test"
    flow:
      - function: "connectToMediator"