tests/enhanced-spike.yml
config:
  target: "https://animo-mediator-qa.ngotag.com"
  phases:
    # Spike testing - sudden high load
    - duration: 5
      arrivalRate: 1
      name: "Baseline"
      
    - duration: 10
      arrivalRate: 100
      name: "Sudden Spike"
      
    - duration: 60
      arrivalRate: 0
      name: "Recovery Period"
      
    # Second spike - test recovery
    - duration: 15
      arrivalRate: 75
      name: "Second Spike"
      
    - duration: 90
      arrivalRate: 0
      name: "Final Recovery"
      
  processor: "./processor-enhanced.js"
  environments:
    NODE_NO_WARNINGS: 1
  
  http:
    timeout: 60
    pool: 150
  
  ensure:
    thresholds:
      - http.response_time.p95: 20000
      - http.response_time.p99: 45000
      - didcomm.connection.duration.p95: 25000
      - didcomm.test.failed.rate: 0.1  # Max 10% failure during spikes

scenarios:
  - name: "Spike Load Test"
    weight: 100
    flow:
      - function: "connectToMediator"