tests/sustained.yml
config:
  target: "https://animo-mediator-qa.ngotag.com"
  phases:
    # Sustained load: 20 wallets per second for 5 minutes
    - duration: 300  # 5 minutes
      arrivalRate: 20
      name: "Sustained Load"
      
  processor: "./processor.js"
  environments:
    NODE_NO_WARNINGS: 1

scenarios:
  - name: "Sustained Load Test"
    flow:
      - function: "connectToMediator"